import React, { useEffect, useState } from 'react';
import { MainSection6CT } from './styles';
import { useInView } from 'react-intersection-observer';

export default function MainSection6(): JSX.Element {
  const [totalLength, setTotalLength] = useState(0);
  const [isEnd, setIsEnd] = useState(false);
  const [current, setCurrent] = useState<4.2 | 2.45 | 1.4 | 1 | 0 | number>(totalLength);
  useEffect(() => {
    const myPath = document.querySelector('#stroke') as SVGPathElement;
    const length = myPath.getTotalLength();
    setTotalLength(length);
  }, []);
  const { ref, inView } = useInView({
    threshold: 0.49,
    triggerOnce: false,
  });
  const { ref: ref2, inView: inView2 } = useInView({
    threshold: 0.49,
    triggerOnce: false,
  });
  const { ref: ref3, inView: inView3 } = useInView({
    threshold: 0.49,
    triggerOnce: false,
  });
  const { ref: ref4, inView: inView4 } = useInView({
    threshold: 0.49,
    triggerOnce: false,
  });
  useEffect(() => {
    if (inView4) {
      setCurrent(1);
    } else if (inView3) {
      setCurrent(1.4);
    } else if (inView2) {
      setCurrent(2.45);
    } else if (inView) {
      setCurrent(4.2);
    } else {
      setCurrent(totalLength);
    }
  }, [inView, inView2, inView3, inView4, totalLength]);
  return (
    <MainSection6CT>
      <div
        style={{
          position: 'absolute',
          zIndex: -10,
          left: 0,
          width: '100%',
          top: 640,
          display: 'flex',
          justifyContent: 'center',
        }}
      >
        <svg width="1200" height="1830" viewBox="0 0 1200 1830" fill="none">
          <path
            onTransitionEnd={e => {
              if (e.isTrusted && current === 1) setIsEnd(true);
              else setIsEnd(false);
            }}
            style={{ transition: '1.5s' }}
            id="stroke"
            d="M404.09 134C647.95 138 661.7 195 661.7 195C676 228.92 646.07 244.88 642.08 247.21C628.44 252.86 622.79 242.89 623.08 239.21C628.08 215.93 665.32 215.93 665.32 215.93C665.32 215.93 693.25 212.93 704.22 237.55C706.22 242.2 716.86 260.49 695.58 279.45C686.27 288.45 655.01 338.64 743.13 427.76C743.13 427.76 827.93 519.54 761.42 544.82L761.19 544.88C759.7 545.26 758.19 545.67 756.75 546.08C754.95 546.58 753.16 547.097 751.38 547.63C749.293 548.237 747.203 548.863 745.11 549.51C742.74 550.23 740.36 550.96 737.99 551.71C735.35 552.53 732.7 553.37 730.06 554.22C727.16 555.14 724.26 556.077 721.36 557.03C718.207 558.05 715.063 559.08 711.93 560.12L701.8 563.5L691.03 567.15L679.69 571L667.75 575.16C663.58 576.61 659.43 578.08 655.27 579.55L642.27 584.16L628.91 589L615.1 594C610.38 595.74 605.657 597.487 600.93 599.24C596.103 601.027 591.273 602.83 586.44 604.65C581.507 606.51 576.58 608.377 571.66 610.25C566.74 612.123 561.74 614.04 556.66 616C551.553 618 546.48 619.977 541.44 621.93C536.4 623.883 531.273 625.907 526.06 628C520.893 630.047 515.73 632.107 510.57 634.18C505.41 636.253 500.22 638.35 495 640.47C489.8 642.59 484.6 644.727 479.4 646.88C474.2 649.033 469 651.207 463.8 653.4C458.607 655.58 453.423 657.78 448.25 660C443.077 662.22 437.92 664.45 432.78 666.69C427.66 668.917 422.547 671.167 417.44 673.44C412.333 675.713 407.277 677.987 402.27 680.26C397.27 682.527 392.27 684.813 387.27 687.12C382.27 689.427 377.377 691.72 372.59 694C367.77 696.28 362.96 698.59 358.16 700.93C353.36 703.27 348.663 705.583 344.07 707.87C339.49 710.157 334.917 712.49 330.35 714.87C325.897 717.15 321.46 719.463 317.04 721.81C312.74 724.09 308.457 726.4 304.19 728.74C300.05 731.007 295.93 733.31 291.83 735.65C287.87 737.883 283.927 740.16 280 742.48C276.233 744.72 272.483 746.997 268.75 749.31C265.177 751.523 261.633 753.777 258.12 756.07C254.787 758.257 251.453 760.49 248.12 762.77C245 764.93 241.91 767.137 238.85 769.39C235.97 771.523 233.127 773.7 230.32 775.92C227.687 778.013 225.103 780.157 222.57 782.35C220.21 784.35 217.89 786.51 215.64 788.68C213.553 790.68 211.53 792.747 209.57 794.88C207.77 796.88 206.04 798.88 204.4 800.95C202.91 802.87 201.49 804.84 200.18 806.89C198.989 808.751 197.91 810.681 196.95 812.67C196.07 814.484 195.331 816.363 194.74 818.29C194.193 820.065 193.808 821.886 193.59 823.73C193.405 825.482 193.405 827.248 193.59 829C193.769 830.726 194.141 832.427 194.7 834.07C195.286 835.773 196.057 837.406 197 838.94C198.029 840.597 199.211 842.153 200.53 843.59C202.01 845.192 203.615 846.673 205.33 848.02C206.27 848.76 207.24 849.47 208.22 850.14C210.813 852.122 213.805 853.517 216.99 854.23C217.99 854.43 219.07 854.61 220.12 854.78L224.18 855.46L229.13 856.27L234.93 857.21L241.56 858.29L248.98 859.51L257.14 860.88L266.03 862.39L275.59 864.06C278.997 864.66 282.403 865.267 285.81 865.88L296.64 867.88L308.04 870.02C312.04 870.78 316.023 871.547 319.99 872.32C324.15 873.133 328.303 873.957 332.45 874.79C336.77 875.663 341.083 876.543 345.39 877.43C349.85 878.363 354.307 879.303 358.76 880.25C363.36 881.23 367.953 882.23 372.54 883.25C377.26 884.25 381.98 885.35 386.69 886.43C391.4 887.51 396.36 888.65 401.18 889.79C406 890.93 411.04 892.14 415.97 893.34C420.9 894.54 425.97 895.81 430.97 897.08C435.97 898.35 441.17 899.68 446.26 901.01C451.35 902.34 456.59 903.75 461.74 905.15C466.89 906.55 472.18 908.01 477.38 909.48C482.58 910.95 487.91 912.48 493.16 914.02C498.41 915.56 503.74 917.16 509.02 918.77C514.3 920.38 519.65 922.04 524.95 923.77C530.25 925.5 535.59 927.19 540.89 928.94C546.19 930.69 551.53 932.5 556.83 934.34C562.13 936.18 567.44 938.04 572.72 939.95C578 941.86 583.27 943.81 588.53 945.79C593.79 947.77 599.01 949.79 604.22 951.86C609.43 953.93 614.6 956.02 619.77 958.16C624.94 960.3 630.03 962.47 635.13 964.7C640.23 966.93 645.24 969.17 650.27 971.47C655.3 973.77 660.22 976.1 665.16 978.47C670.1 980.84 674.91 983.26 679.75 985.73C684.59 988.2 689.3 990.73 694.03 993.25C698.76 995.77 703.4 998.3 708 1001C712.6 1003.7 717.06 1006.28 721.53 1009C726 1011.72 730.3 1014.45 734.62 1017.28C738.94 1020.11 743.09 1022.9 747.26 1025.82C751.43 1028.74 755.4 1031.62 759.39 1034.62C763.38 1037.62 767.19 1040.62 771 1043.7C774.81 1046.78 778.42 1049.85 782 1053.05C785.58 1056.25 789 1059.38 792.44 1062.67C795.88 1065.96 799.05 1069.19 802.24 1072.57C805.43 1075.95 808.42 1079.28 811.37 1082.76C814.32 1086.24 817.09 1089.66 819.8 1093.23C822.51 1096.8 825.03 1100.33 827.49 1103.99C829.95 1107.65 832.21 1111.28 834.4 1114.99C836.59 1118.7 838.6 1122.49 840.5 1126.34C842.4 1130.19 844.15 1134.04 845.76 1137.99C847.37 1141.94 848.83 1145.9 850.14 1149.99C851.45 1154.08 852.61 1158.12 853.61 1162.25C854.61 1166.38 855.46 1170.59 856.13 1174.81C856.8 1179.03 857.33 1183.38 857.67 1187.69C858.01 1192 858.19 1196.49 858.19 1200.89C858.19 1200.89 809.66 1396.34 706.65 1441.02C706.08 1440.45 686.27 1454.95 661.33 1429.68C658.33 1426.02 645.03 1405.68 659 1395.43C661 1394.43 669.64 1391.77 675 1404.43C676.66 1409.09 687.64 1451.65 651.39 1471.61C651.39 1471.61 572.25 1503.2 524.03 1473.27C524.03 1473.27 504.3 1456.64 478.14 1475.49C478.14 1475.49 365.27 1546.36 383.2 1581.3C383.36 1581.51 391.9 1596.4 505.02 1616.56C588.87 1631.5 690.96 1662.44 690.96 1714.69"
            stroke="#A4CCFB"
            strokeWidth={1.5}
            stroke-miterlimit="10"
            strokeDasharray={totalLength}
            strokeDashoffset={totalLength - totalLength / current}
          />
          {isEnd && (
            <path
              d="M684 1710L691.5 1714.5L698.5 1706"
              stroke="#A4CCFB"
              strokeWidth={1.5}
              strokeDashoffset={0}
            />
          )}
        </svg>
      </div>
      <h2>
        라이브 커머스의
        <br className="mobile" /> 모든 것 <em>(Production)</em>
      </h2>
      <p>
        브랜드 컨셉부터 데이터 리포트까지 <br />5 Step으로 쉽고 빠르게 시작해보세요.
      </p>
      <ul>
        <li>
          <img src="/img/ver2/process/Consulting.png" alt="" />
          <h4>
            <strong>Step 1. </strong>문의 및 상담
          </h4>
          <p>
            온라인 및 오프라인 미팅을 통해 프로세스와 비용 등을
            <br className="mobile" /> 조정합니다.
            <br className="desktop" />
            계약 시 브랜드 컨셉과 상품에 따라
            <br className="mobile" /> 담당 PD가 배정됩니다.
          </p>
        </li>
        <li ref={ref}>
          <img src="/img/ver2/process/Planning.png" alt="" />
          <h4>
            <strong>Step 2. </strong>라이브/상품 기획
          </h4>
          <p>
            담당 PD와 연출 스탭들로 만들어진 TF팀이
            <br className="mobile" /> 라이브 방송을 기획합니다. <br />
            사전 미팅 내용을 기반으로 방송에 필요한 판넬 및<br className="mobile" />{' '}
            디자인 소스부터
            <br className="desktop" />
            큐시트, 스크립트, 스토리보드,
            <br className="mobile" /> 콘티까지 최적의 연출을 위한 스타일링을 구성합니다.
          </p>
        </li>
        <li ref={ref2}>
          <img src="/img/ver2/process/Showhost.png" alt="" />
          <h4>
            <strong>Step 3. </strong>쇼호스트 매칭
          </h4>
          <p>
            브랜드 컨셉에 맞춘 쇼호스트와 인플루언서를 선정합니다. <br />
            (라이즈 스튜디오는 160명 이상의 쇼호스트와 함께 하고 있습니다.)
          </p>
        </li>
        <li ref={ref3}>
          <img src="/img/ver2/process/Broadcasting.png" alt="" />
          <h4>
            <strong>Step 4. </strong>라이브 송출
          </h4>
          <p>
            방송 전 촬영장 스타일링과 원활한 송출을 위한 리허설을
            <br className="mobile" /> 진행하고
            <br className="desktop" />
            PD, 스탭, 쇼호스트로 구성된 TF팀이
            <br className="mobile" /> 라이브 방송을 진행합니다.
          </p>
        </li>
        <li ref={ref4}>
          <img src="/img/ver2/process/Data.png" alt="" />
          <h4>
            <strong>Step 5. </strong>데이터 리포트
          </h4>
          <p>
            라이브 진행 시점부터의 판매량을 실시간으로 모니터링하여
            <br className="mobile" /> 데이터를 수집합니다.
            <br className="desktop" />
            시청자 및 구매자 유형, 판매 상품 수량, 총 판매 금액 등을 리포트로 작성하여
            <br className="desktop" />
            &nbsp; 데이터를 생성하여
            <br className="mobile" /> 다음 전략을 수립합니다.
          </p>
        </li>
      </ul>
    </MainSection6CT>
  );
}
